       IDENTIFICATION DIVISION.
       PROGRAM-ID. COPYBOOK-TEST.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       COPY CUSTOMER.
       PROCEDURE DIVISION.
           MOVE "JOHN DOE" TO CUST-NAME.
           MOVE 12345 TO CUST-ID.
           DISPLAY "NAME: " CUST-NAME.
           DISPLAY "ID:   " CUST-ID.
           STOP RUN.
