       IDENTIFICATION DIVISION.
       PROGRAM-ID. FILE-READ.
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT INPUT-FILE ASSIGN TO "test_data.dat"
               ORGANIZATION IS SEQUENTIAL.
       DATA DIVISION.
       FILE SECTION.
       FD INPUT-FILE.
       01  INPUT-RECORD     PIC X(80).
       WORKING-STORAGE SECTION.
       01  WS-EOF           PIC 9 VALUE 0.
       PROCEDURE DIVISION.
           OPEN INPUT INPUT-FILE.
           PERFORM READ-LOOP UNTIL WS-EOF = 1.
           CLOSE INPUT-FILE.
           STOP RUN.
       READ-LOOP.
           READ INPUT-FILE INTO INPUT-RECORD
               AT END MOVE 1 TO WS-EOF.
           IF WS-EOF = 0
               DISPLAY INPUT-RECORD.
